<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"7d12ef70e452d342610069b3fc8d070d7f8c96f7d93b595452a21241f5b11148","plan_job_ref":"Job Plan Airflow DAGs #515 at https://github.com/cal-itp/data-infra/actions/runs/17257974579","plan_out_hash":"3fc6266de95d5eaec1042c566b460c255474a099d14349efdaa6db6af8972953","plan_hash":"efa1deae1051ff5c449789e1b4e5e2c7e33b76f17c3f24204790da72ad6c0c89","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 19 to add, 0 to change, 2 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/copy_production_to_staging/airtable_california_transit.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/copy_production_to_staging/airtable_california_transit.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/copy_production_to_staging/airtable_california_transit.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/copy_production_to_staging/airtable_transit_data_quality_issues.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/copy_production_to_staging/airtable_transit_data_quality_issues.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/copy_production_to_staging/airtable_transit_data_quality_issues.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/copy_production_to_staging/airtable_transit_technology_stacks.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/copy_production_to_staging/airtable_transit_technology_stacks.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/copy_production_to_staging/airtable_transit_technology_stacks.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/copy_production_to_staging/gtfs_aggregator_scrape_results.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/copy_production_to_staging/gtfs_aggregator_scrape_results.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/copy_production_to_staging/gtfs_aggregator_scrape_results.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/copy_production_to_staging/gtfs_rt_parsed_service_alerts.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/copy_production_to_staging/gtfs_rt_parsed_service_alerts.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/copy_production_to_staging/gtfs_rt_parsed_service_alerts.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/copy_production_to_staging/gtfs_rt_parsed_trip_updates.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/copy_production_to_staging/gtfs_rt_parsed_trip_updates.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/copy_production_to_staging/gtfs_rt_parsed_trip_updates.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/copy_production_to_staging/gtfs_rt_parsed_vehicle_positions.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/copy_production_to_staging/gtfs_rt_parsed_vehicle_positions.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/copy_production_to_staging/gtfs_rt_parsed_vehicle_positions.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/copy_production_to_staging/gtfs_rt_raw_v2.yml"] will be destroyed
  # (because key ["dags/copy_production_to_staging/gtfs_rt_raw_v2.yml"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "tcLsUw==" -> null
-       detect_md5hash      = "8b9KR/VgZjof6N0dkg/HIw==" -> null
-       event_based_hold    = false -> null
-       generation          = 1756151437924099 -> null
-       id                  = "calitp-staging-composer-dags/copy_production_to_staging/gtfs_rt_raw_v2.yml" -> null
-       md5hash             = "8b9KR/VgZjof6N0dkg/HIw==" -> null
-       md5hexhash          = "f1bf4a47f560663a1fe8dd1d920fc723" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fcopy_production_to_staging%2Fgtfs_rt_raw_v2.yml?generation=1756151437924099&alt=media" -> null
-       metadata            = {} -> null
-       name                = "dags/copy_production_to_staging/gtfs_rt_raw_v2.yml" -> null
-       output_name         = "dags/copy_production_to_staging/gtfs_rt_raw_v2.yml" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fcopy_production_to_staging%2Fgtfs_rt_raw_v2.yml" -> null
-       source              = "../../../../airflow/dags/copy_production_to_staging/gtfs_rt_raw_v2.yml" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/copy_production_to_staging/gtfs_rt_schedule_parsed.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/copy_production_to_staging/gtfs_rt_schedule_parsed.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/copy_production_to_staging/gtfs_rt_schedule_parsed.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/copy_production_to_staging/gtfs_rt_schedule_parsed_txt_results.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/copy_production_to_staging/gtfs_rt_schedule_parsed_txt_results.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/copy_production_to_staging/gtfs_rt_schedule_parsed_txt_results.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/copy_production_to_staging/gtfs_rt_validation_service_alerts.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/copy_production_to_staging/gtfs_rt_validation_service_alerts.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/copy_production_to_staging/gtfs_rt_validation_service_alerts.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/copy_production_to_staging/gtfs_rt_validation_trip_updates.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/copy_production_to_staging/gtfs_rt_validation_trip_updates.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/copy_production_to_staging/gtfs_rt_validation_trip_updates.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/copy_production_to_staging/gtfs_rt_validation_vehicle_positions.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/copy_production_to_staging/gtfs_rt_validation_vehicle_positions.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/copy_production_to_staging/gtfs_rt_validation_vehicle_positions.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/copy_production_to_staging/gtfs_schedule_download_configs.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/copy_production_to_staging/gtfs_schedule_download_configs.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/copy_production_to_staging/gtfs_schedule_download_configs.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/copy_production_to_staging/gtfs_schedule_download_outcomes.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/copy_production_to_staging/gtfs_schedule_download_outcomes.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/copy_production_to_staging/gtfs_schedule_download_outcomes.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/copy_production_to_staging/gtfs_schedule_raw_v2.yml"] will be destroyed
  # (because key ["dags/copy_production_to_staging/gtfs_schedule_raw_v2.yml"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "iTZpMg==" -> null
-       detect_md5hash      = "z0Y7C2IcEXFhgNjJn/9VZQ==" -> null
-       event_based_hold    = false -> null
-       generation          = 1756151437924266 -> null
-       id                  = "calitp-staging-composer-dags/copy_production_to_staging/gtfs_schedule_raw_v2.yml" -> null
-       md5hash             = "z0Y7C2IcEXFhgNjJn/9VZQ==" -> null
-       md5hexhash          = "cf463b0b621c11716180d8c99fff5565" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fcopy_production_to_staging%2Fgtfs_schedule_raw_v2.yml?generation=1756151437924266&alt=media" -> null
-       metadata            = {} -> null
-       name                = "dags/copy_production_to_staging/gtfs_schedule_raw_v2.yml" -> null
-       output_name         = "dags/copy_production_to_staging/gtfs_schedule_raw_v2.yml" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fcopy_production_to_staging%2Fgtfs_schedule_raw_v2.yml" -> null
-       source              = "../../../../airflow/dags/copy_production_to_staging/gtfs_schedule_raw_v2.yml" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/copy_production_to_staging/gtfs_schedule_unzip_outcomes.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/copy_production_to_staging/gtfs_schedule_unzip_outcomes.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/copy_production_to_staging/gtfs_schedule_unzip_outcomes.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/copy_production_to_staging/gtfs_schedule_validation_notices.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/copy_production_to_staging/gtfs_schedule_validation_notices.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/copy_production_to_staging/gtfs_schedule_validation_notices.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/copy_production_to_staging/gtfs_schedule_validation_outcomes.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/copy_production_to_staging/gtfs_schedule_validation_outcomes.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/copy_production_to_staging/gtfs_schedule_validation_outcomes.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/copy_production_to_staging/high_quality_transit_areas_areas.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/copy_production_to_staging/high_quality_transit_areas_areas.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/copy_production_to_staging/high_quality_transit_areas_areas.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/copy_production_to_staging/state_highway_network.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/copy_production_to_staging/state_highway_network.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/copy_production_to_staging/state_highway_network.yml"
+       storage_class  = (known after apply)
    }

Plan: 19 to add, 0 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #515](https://github.com/cal-itp/data-infra/actions/runs/17257974579)